using System;
using System.Collections.Generic;
using System.Collections.ObjectModel;
using System.ComponentModel;
using System.Data.SqlClient;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using static System.Console;

namespace GB_Algoritmen_Lesson_6
{

    /// <summary>
    /// Студент
    /// </summary>
    public class Student: IComparable<Student>
    {
        public Student()
        {
        }

        public Student(string name, int age, int id)
        {
            Name = name;
            Age = age;
            Id = id;
        }

        public string Name { get; set; }
        public int Age { get; set; }
        public int Id { get; set; }

        public int CompareTo(Student obj) => obj.Id < this.Id ? 1 : 0;
        public static bool operator ==(Student s1, Student s2) =>  s1.Id == s2.Id;
        public static bool operator !=(Student s1, Student s2) => s1.Id != s2.Id;
        public static bool operator >=(Student s1, Student s2) => s1.Id >= s2.Id;
        public static bool operator <=(Student s1, Student s2) => s1.Id <= s2.Id;


    }


    /// <summary>
    /// Работа с БД
    /// </summary>
    class StudentAct
    {
        static string connectionString =
            @"Data Source=(localdb)\MSSQLLocalDB;
              Initial Catalog=demo25112019;
              Integrated Security=True;
              Pooling=False";
        Random random = new Random();

        /// <summary>
        ///Все имена
        /// </summary>
        public static string[] allName = new string[] { "Аарон", "Абрам", "Август", "Августин", "Авксентий", "Авраам", "Агап", "Агафон", "Адис", "Адольф", "Азарий", "Азат", "Айрат", "Акакий", "Алан", "Алевтин", "Алексий", "Ален", "Алмаз", "Алоис", "Альфред", "Амадей", "Амвросий", "Амин", "Анвар", "Ангел", "Андрон", "Андрэ", "Анисим", "Антип", "Ануфрий", "Анфим", "Арам", "Арий", "Арман", "Армен", "Арон", "Арсен", "Артамон", "Артем", "Архип", "Архипп", "Афанасий", "Афиноген", "Бахрам", "Бежен", "Бернар", "Богдан", "Бонифаций", "Бореслав", "Боян", "Бронислав", "Вадим", "Валентин", "Вальдемар", "Вальтер", "Варлам", "Варфоломей", "Вацлав", "Велизар", "Венедикт", "Вениамин", "Вилен", "Вилли", "Виталий", "Витаутас", "Владимир", "Владислав", "Власий", "Володар", "Вячеслав", "Гавриил", "Гайдар", "Галактион", "Гаспар", "Гастон", "Геворг", "Геласий", "Генри", "Генрих", "Герасим", "Герман", "Гоар", "Гордей", "Градимир", "Граф", "Густав", "Давид", "Дамиан", "Дамир", "Данила", "Данислав", "Дементий", "Демид", "Денис", "Джамал", "Джозеф", "Джордан", "Дик", "Димитрий", "Диомид", "Дмитрий", "Донат", "Донатос", "Евграф", "Евдоким", "Евсей", "Евстафий", "Елизар", "Елисей", "Еремей", "Ермак", "Ерофей", "Ефим", "Жан", "Ждан", "Закир", "Замир", "Захария", "Зенон", "Зорий", "Зосима", "Иакинф", "Ибрагим", "Игнатий", "Игорь", "Израиль", "Изяслав", "Илларион", "Ильхам", "Ильяс", "Иннокентий", "Иоанн", "Ион", "Иосиф", "Ипполит", "Ириней", "Ириний", "Исаакий", "Исай", "Искандер", "Ислам", "Июлий", "Казбек", "Камиль", "Капитон", "Карл", "Каспар", "Кир", "Кирилл", "Клемент", "Клементий", "Клод", "Кондрат", "Конрад", "Константин", "Краснослав", "Ксаннф", "Лавр", "Лаврентий", "Лев", "Леван", "Леон", "Леонард", "Леопольд", "Лермонт", "Лукий", "Лукьян", "Людвиг", "Люсьен", "Магистриан", "Мадлен", "Макар", "Макарий", "Максимилиан", "Максимильян", "Мануил", "Мар", "Марин", "Марк", "Марсель", "Мартин", "Махмуд", "Мелентий", "Мечеслав", "Мечислав", "Милан", "Милен", "Мирон", "Мирослав", "Митя", "Михаил", "Модест", "Моисей", "Муслим", "Мухаммед", "Назарий", "Наиль", "Неонил", "Нестор", "Никифор", "Никодим", "Никон", "Нил", "Нифонт", "Новомир", "Овидий", "Октябрь", "Олесь", "Ольгерд", "Орест", "Орландо", "Остап", "Остромир", "Панкрат", "Пантелеймон", "Парфений", "Пахом", "Пимен", "Платон", "Прозор", "Прокопий", "Прохор", "Равиль", "Радислав", "Радомир", "Разумник", "Раис", "Рамазан", "Рамиз", "Ранель", "Расим", "Ратмир", "Рафаил", "Рашид", "Рем", "Рифат", "Рихард", "Родион", "Ролан", "Рубен", "Рудольф", "Руфин", "Рушан", "Савва", "Савел", "Самсон", "Самуил", "Светозар", "Светослав", "Святослав", "Севастьян", "Северьян", "Семен", "Сидор", "Сильвестр", "Сократ", "Соломон", "Стакрат", "Сталий", "Степан", "Стефан", "Султан", "Тагир", "Талик", "Тамаз", "Тельман", "Тельнан", "Тибор", "Тиграм", "Тимон", "Тимофей", "Тихомир", "Тихон", "Трофим", "Тунгуз", "Устин", "Фаддей", "Фанис", "Фарид", "Федосей", "Федот", "Феодосий", "Фердинанд", "Филимон", "Филипп", "Франц", "Фред", "Фуад", "Хабиб", "Христиан", "Христос", "Чарльз", "Чеслав", "Шамиль", "Шарль", "Щеголь", "Эдвард", "Эдуард", "Эльдар", "Эммануил", "Эраст", "Юлиан", "Юлий", "Юстин", "Юхим", "Якун", "Ян", "Ярослав", "Ясон", };
        /// <summary>
        /// Все фамилии
        /// </summary>
        public static string[] allSurname = new string[] { "Иванов", "Смирнов", "Кузнецов", "Попов", "Васильев", "Петров", "Соколов", "Михайлов", "Новиков", "Федоров", "Морозов", "Волков", "Алексеев", "Лебедев", "Семенов", "Егоров", "Павлов", "Козлов", "Степанов", "Николаев", "Орлов", "Андреев", "Макаров", "Никитин", "Захаров", "Зайцев", "Соловьев", "Борисов", "Яковлев", "Григорьев", "Романов", "Воробьев", "Сергеев", "Кузьмин", "Фролов", "Александров", "Дмитриев", "Королев", "Гусев", "Киселев", "Ильин", "Максимов", "Поляков", "Сорокин", "Виноградов", "Ковалев", "Белов", "Медведев", "Антонов", "Тарасов", "Жуков", "Баранов", "Филиппов", "Комаров", "Давыдов", "Беляев", "Герасимов", "Богданов", "Осипов", "Сидоров", "Матвеев", "Титов", "Марков", "Миронов", "Крылов", "Куликов", "Карпов", "Власов", "Мельников", "Денисов", "Гаврилов", "Тихонов", "Казаков", "Афанасьев", "Данилов", "Савельев", "Тимофеев", "Фомин", "Чернов", "Абрамов", "Мартынов", "Ефимов", "Федотов", "Щербаков", "Назаров", "Калинин", "Исаев", "Чернышев", "Быков", "Маслов", "Родионов", "Коновалов", "Лазарев", "Воронин", "Климов", "Филатов", "Пономарев", "Голубев", "Кудрявцев", "Прохоров", "Наумов", "Потапов", "Журавлев", "Овчинников", "Трофимов", "Леонов", "Соболев", "Ермаков", "Колесников", "Гончаров", "Емельянов", "Никифоров", "Грачев", "Котов", "Гришин", "Ефремов", "Архипов", "Громов", "Кириллов", "Малышев", "Панов", "Моисеев", "Румянцев", "Акимов", "Кондратьев", "Бирюков", "Горбунов", "Анисимов", "Еремин", "Тихомиров", "Галкин", "Лукьянов", "Михеев", "Скворцов", "Юдин", "Белоусов", "Нестеров", "Симонов", "Прокофьев", "Харитонов", "Князев", "Цветков", "Левин", "Митрофанов", "Воронов", "Аксенов", "Софронов", "Мальцев", "Логинов", "Горшков", "Савин", "Краснов", "Майоров", "Демидов", "Елисеев", "Рыбаков", "Сафонов", "Плотников", "Демин", "Хохлов", "Фадеев", "Молчанов", "Игнатов", "Литвинов", "Ершов", "Ушаков", "Дементьев", "Рябов", "Мухин", "Калашников", "Леонтьев", "Лобанов", "Кузин", "Корнеев", "Евдокимов", "Бородин", "Платонов", "Некрасов", "Балашов", "Бобров", "Жданов", "Блинов", "Игнатьев", "Коротков", "Муравьев", "Крюков", "Беляков", "Богомолов", "Дроздов", "Лавров", "Зуев", "Петухов", "Ларин", "Никулин", "Серов", "Терентьев", "Зотов", "Устинов", "Фокин", "Самойлов", "Константинов", "Сахаров", "Шишкин", "Самсонов", "Черкасов", "Чистяков", "Носов", "Спиридонов", "Карасев", "Авдеев", "Воронцов", "Зверев", "Владимиров", "Селезнев", "Нечаев", "Кудряшов", "Седов", "Фирсов", "Андрианов", "Панин", "Головин", "Терехов", "Ульянов", "Шестаков", "Агеев", "Никонов", "Селиванов", "Баженов", "Гордеев", "Кожевников", "Пахомов", "Зимин", "Костин", "Широков", "Филимонов", "Ларионов", "Овсянников", "Сазонов", "Суворов", "Нефедов", "Корнилов", "Любимов", "Львов", "Горбачев", "Копылов", "Лукин", "Токарев", "Кулешов", "Шилов", "Большаков", "Панкратов", "Родин", "Шаповалов", "Покровский", "Бочаров", "Никольский", "Маркин", "Горелов", "Агафонов", "Березин", "Ермолаев", "Зубков", "Куприянов", "Трифонов", "Масленников", "Круглов", "Третьяков", "Колосов", "Рожков", "Артамонов", "Шмелев", "Лаптев", "Лапшин", "Федосеев", "Зиновьев", "Зорин", "Уткин", "Столяров", "Зубов", "Ткачев", "Дорофеев", "Антипов", "Завьялов", "Свиридов", "Золотарев", "Кулаков", "Мещеряков", "Макеев", "Дьяконов", "Гуляев", "Петровский", "Бондарев", "Поздняков", "Панфилов", "Кочетков", "Суханов", "Рыжов", "Старостин", "Калмыков", "Колесов", "Золотов", "Кравцов", "Субботин", "Шубин", "Щукин", "Лосев", "Винокуров", "Лапин", "Парфенов", "Исаков", "Голованов", "Коровин", "Розанов", "Артемов", "Козырев", "Русаков", "Алешин", "Крючков", "Булгаков", "Кошелев", "Сычев", "Синицын", "Черных", "Рогов", "Кононов", "Лаврентьев", "Евсеев", "Пименов", "Пантелеев", "Горячев", "Аникин", "Лопатин", "Рудаков", "Одинцов", "Серебряков", "Панков", "Дегтярев", "Орехов", "Царев", "Шувалов", "Кондрашов", "Горюнов", "Дубровин", "Голиков", "Курочкин", "Латышев", "Севастьянов", "Вавилов", "Ерофеев", "Сальников", "Клюев", "Носков", "Озеров", "Кольцов", "Комиссаров", "Меркулов", "Киреев", "Хомяков", "Булатов", "Ананьев", "Буров", "Шапошников", "Дружинин", "Островский", "Шевелев", "Долгов", "Суслов", "Шевцов", "Пастухов", "Рубцов", "Бычков", "Глебов", "Ильинский", "Успенский", "Дьяков", "Кочетов", "Вишневский", "Высоцкий", "Глухов", "Дубов", "Бессонов", "Ситников", "Астафьев", "Мешков", "Шаров", "Яшин", "Козловский", "Туманов", "Басов", "Корчагин", "Болдырев", "Олейников", "Чумаков", "Фомичев", "Губанов", "Дубинин", "Шульгин", "Касаткин", "Пирогов", "Семин", "Трошин", "Горохов", "Стариков", "Щеглов", "Фетисов", "Колпаков", "Чесноков", "Зыков", "Верещагин", "Минаев", "Руднев", "Троицкий", "Окулов", "Ширяев", "Малинин", "Черепанов", "Измайлов", "Алехин", "Зеленин", "Касьянов", "Пугачев", "Павловский", "Чижов", "Кондратов", "Воронков", "Капустин", "Сотников", "Демьянов", "Косарев", "Беликов", "Сухарев", "Белкин", "Беспалов", "Кулагин", "Савицкий", "", "Жаров", "Хромов", "Еремеев", "Карташов", "Астахов", "Русанов", "Сухов", "Вешняков", "Волошин", "Козин", "Худяков", "Жилин", "Малахов", "Сизов", "Ежов", "Толкачев", "Анохин", "Вдовин", "Бабушкин", "Усов", "Лыков", "Горлов", "Коршунов", "Маркелов", "Постников", "Черный", "Дорохов", "Свешников", "Гущин", "Калугин", "Блохин", "Сурков", "Кочергин", "Греков", "Казанцев", "Швецов", "Ермилов", "Парамонов", "Агапов", "Минин", "Корнев", "Черняев", "Гуров", "Ермолов", "Сомов", "Добрынин", "Барсуков", "Глушков", "Чеботарев", "Москвин", "Уваров", "Безруков", "Муратов", "Раков", "Снегирев", "Гладков", "Злобин", "Моргунов", "Поликарпов", "Рябинин", "Судаков", "Кукушкин", "Калачев", "Грибов", "Елизаров", "Звягинцев", "Корольков", "Федосов", };

        /// <summary>
        /// Заполнить БД
        /// </summary>
        public void FillWithRandomData()
        {
            SQLCommandWrite($@"DROP TABLE Student;");
            SQLCommandWrite($@"CREATE TABLE [dbo].[Student] (
                            [Id]           INT            IDENTITY (1, 1) NOT NULL,
                            [Name]         NVARCHAR (MAX) NOT NULL,
                            [Age]          BIGINT         NOT NULL,
                            CONSTRAINT [PK_dbo.Student] PRIMARY KEY CLUSTERED ([Id] ASC));");

               var empl = random.Next(100, 500);

                for (var j = 0; j < empl; ++j)                
                    SQLCommandWrite($@"INSERT INTO Student (Name, Age) VALUES (N'{allName[random.Next(0, allName.Length)]}', {random.Next(14, 30)})");
        }

        /// <summary>
        /// Обработка SQL комманд
        /// </summary>
        /// <param name="commandTxt"></param>
        public void SQLCommandWrite(string commandTxt)
        {
            SqlCommand command;
            try
            {
                using (SqlConnection connection = new SqlConnection(connectionString))
                {
                    connection.Open();
                    command = new SqlCommand(commandTxt, connection);
                    command.ExecuteNonQuery();
                    connection.Close();
                }
            }
            catch (Exception e)
            {
                WriteLine(e.Message);
            }
        }

        public List<Student> GetFromBD()
        {
            var list = new List<Student>();
            try
            {
                using (SqlConnection connection = new SqlConnection(connectionString))
                {
                    connection.Open();
                    SqlCommand command = new SqlCommand("SELECT * FROM Student", connection);
                    SqlDataReader reader = command.ExecuteReader();
                    while (reader.Read()) // построчно считываем данные     
                    {
                        list.Add(new Student((string)reader.GetValue(1), (int)((long)reader.GetValue(2)), (int)reader.GetValue(0)));                        
                    }                    
                }
            }
            catch (Exception ex)
            {
                WriteLine(ex.Message);
            }

            return list;
        }
    }
}
